Revit 2025 API
HardwoodTintEnabledType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodTintEnabled" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HardwoodTintEnabledType
Public Enumeration HardwoodTintEnabledType
public enum class HardwoodTintEnabledType
type HardwoodTintEnabledType
Members
Member name | Value | Description
NoColor | 0
ColorChoice | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace